---
type: CableTrayConduitBase
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 5
tags: [revit-api, class]
---

# CableTrayConduitBase

`Autodesk.Revit.DB.Electrical.CableTrayConduitBase` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidEndPoints | — | `public static bool IsValidEndPoints ( XYZ startPoint , XYZ endPoint )` |
| Method | IsValidLevelId | — | `public static bool IsValidLevelId ( Document document , ElementId levelId )` |
| Method | IsWithFitting | — | `public bool IsWithFitting ()` |
| Property | Parameter | — | `` |
| Property | RunId | — | `public ElementId RunId { get ; }` |